{"config": {"input_layers": [["input_3", 0, 0], ["input_4", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 51], "sparse": false, "dtype": "float32", "name": "input_4"}, "class_name": "InputLayer", "name": "input_4", "inbound_nodes": []}, {"config": {"batch_input_shape": [null, null, 173056], "sparse": false, "dtype": "float32", "name": "input_3"}, "class_name": "InputLayer", "name": "input_3", "inbound_nodes": []}, {"config": {"embeddings_regularizer": null, "name": "embedding_2", "batch_input_shape": [null, 51], "trainable": true, "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "embeddings_constraint": null, "output_dim": 256, "dtype": "float32", "activity_regularizer": null, "mask_zero": false, "input_dim": 11857, "input_length": 51}, "class_name": "Embedding", "name": "embedding_2", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"config": {"recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "stateful": false, "recurrent_constraint": null, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": true, "dropout": 0.0, "activity_regularizer": null, "trainable": true, "unroll": false, "unit_forget_bias": true, "return_sequences": false, "bias_regularizer": null, "go_backwards": false, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "use_bias": true, "units": 256, "implementation": 1, "activation": "tanh", "name": "lstm_3", "kernel_constraint": null}, "class_name": "LSTM", "name": "lstm_3", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"config": {"recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "stateful": false, "recurrent_constraint": null, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": true, "dropout": 0.0, "activity_regularizer": null, "trainable": true, "unroll": false, "unit_forget_bias": true, "return_sequences": false, "bias_regularizer": null, "go_backwards": false, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "use_bias": true, "units": 256, "implementation": 1, "activation": "tanh", "name": "lstm_4", "kernel_constraint": null}, "class_name": "LSTM", "name": "lstm_4", "inbound_nodes": [[["embedding_2", 0, 0, {}], ["lstm_3", 0, 1, {}], ["lstm_3", 0, 2, {}]]]}, {"config": {"kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "units": 11857, "activation": "linear", "activity_regularizer": null, "name": "dense_2", "trainable": true, "kernel_constraint": null}, "class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["lstm_4", 0, 0, {}]]]}, {"config": {"function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwgAAAB8AABkAQAbUykCTukBAAAAqQApAdoBeHICAAAAcgIA\nAAD6HzxpcHl0aG9uLWlucHV0LTE0LWQ2ZTcwZjg3MWFlOT7aCDxsYW1iZGE+DQAAAHMAAAAA\n", null, null], "arguments": {}, "function_type": "lambda", "output_shape_type": "raw", "name": "lambda_2", "trainable": true, "output_shape": null}, "class_name": "Lambda", "name": "lambda_2", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"config": {"activation": "softmax", "name": "activation_2", "trainable": true}, "class_name": "Activation", "name": "activation_2", "inbound_nodes": [[["lambda_2", 0, 0, {}]]]}], "output_layers": [["activation_2", 0, 0]], "name": "model_2"}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.4"}